import os
import psycopg2
from psycopg2 import extras
from dotenv import load_dotenv
from flask import Flask

load_dotenv()

cities = [
    "Нью-Йорк", "Лос-Анджелес", "Чикаго", "Хьюстон", "Финикс", "Филадельфия", "Сан-Антонио", "Сан-Диего",
    "Даллас", "Сан-Хосе", "Лондон", "Берлин", "Мадрид", "Рим", "Париж", "Барселона", "Амстердам",
    "Стамбул", "Лиссабон", "Милан", "Вена", "Мюнхен", "Цюрих", "Женева", "Брюссель", "Копенгаген",
    "Осло", "Хельсинки", "Будапешт", "Прага", "Бухарест", "София", "Киев", "Москва", "Санкт-Петербург",
    "Дубай", "Абу-Даби", "Рияд", "Тель-Авив", "Сеул", "Токио", "Осака", "Пекин", "Шанхай", "Гонконг",
    "Шэньчжэнь", "Сингапур", "Сидней", "Мельбурн", "Брисбен", "Ванкувер", "Торонто", "Монреаль",
    "Оттава", "Лос-Кабос", "Мехико", "Гвадалахара", "Калгари", "Эдмонтон", "Сан-Паулу", "Рио-де-Жанейро",
    "Буэнос-Айрес", "Сантьяго", "Лима", "Кито", "Медельин", "Картахена", "Асунсьон", "Ресифи",
    "Форталеза", "Куритиба", "Белу-Оризонти", "Салвадор", "Портленд", "Сиэтл", "Миннеаполис", "Кливленд",
    "Цинциннати", "Нэшвилл", "Роли", "Омаха", "Сан-Хуан", "Акапулько", "Гвадалахара", "Малага", "Валенсия",
    "Севилья", "Марсель", "Лион", "Тулуза", "Страсбург", "Гренобль", "Лилль", "Бордо", "Нант", "Ренн",
    "Кан", "Антверпен", "Гент", "Остенде", "Тилбург", "Эйндховен", "Ним", "Монтпелье", "Тур", "Клермон-Ферран",
    "Ла-Рошель", "Фрухт", "Падова", "Венеция", "Савона", "Дженоа", "Реджо-Эмилия", "Модена", "Сассари",
    "Палермо", "Неаполь", "Калабрия", "Катанья", "Римини", "Чезена", "Сиена", "Ливорно", "Барлетта",
    "Бари", "Гвадалахара", "Кампиас", "Сан-Луис", "Кампинас", "Лондрина", "Сан-Жозе-дус-Кампус", "Манаус",
    "Порту-Алегри", "Флорианополис", "Ресифи", "Гояния", "Палмейра", "Питер", "Калгари", "Манчестер",
    "Бирмингем", "Ливерпуль", "Шеффилд", "Ноттингем", "Лестер", "Лидс", "Саутгемптон", "Халл", "Кардифф",
    "Норвич", "Ковентри", "Сандерленд", "Дерби", "Стори", "Ульм", "Мюнхен", "Лейпциг", "Дрезден",
    "Гамбург", "Вюрцбург", "Нюрнберг", "Кельн", "Геттинген", "Магдебург", "Регенсбург", "Фрайбург",
    "Бонн", "Роттердам", "Утрехт", "Харлем", "Гаага", "Эссин", "Неймеген", "Дордреехт", "Лейден",
    "Массдайк", "Хильверсюм", "Гронинген", "Ла-Рошель", "Брест", "Тур", "Нанси", "Сен-Этьен",
    "Анталья", "Ханчжоу", "Сучжоу", "Венеция", "Монте-Карло", "Ниньбо", "Сания", "Хайкоу", "Гуанчжоу"
]

app = Flask(__name__)
app.secret_key = os.getenv("SECRET_KEY")


DATABASE_CONFIG = {
    'host': os.getenv("DB_HOST"),
    'database': os.getenv("DB_NAME"),
    'user': os.getenv("DB_USER"),
    'password': os.getenv("DB_PASS"),
    'port': os.getenv("DB_PORT")
}


def create_connection():
    return psycopg2.connect(**DATABASE_CONFIG)


class DB:
    def __enter__(self):
        self.conn = psycopg2.connect(**DATABASE_CONFIG)
        self.cursor = self.conn.cursor(cursor_factory=psycopg2.extras.DictCursor)
        return self.cursor

    def __exit__(self, exc_type, exc_value, traceback):
        if exc_type is None:
            self.conn.commit()
        self.cursor.close()
        self.conn.close()
